tutorials/combustion/fireFoam/les/oppositeBurningPanels/constant/pyrolysisZones
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pyrolysis
{
    active          true;

    pyrolysisModel  reactingOneDim;

    regionName      panelRegion;

    reactingOneDimCoeffs
    {
        gasHSource      false; //Energy source term due to pyrolysis gas
        QrHSource       false; //Energy source term due in depht radiation
        minimumDelta    1e-12;

        reactionDeltaMin 1e-12;

        moveMesh        false;
    }

    infoOutput      true;
}


// ************************************************************************* //
